app/Controllers/LoginController.php

    public function loginProcess()
    {
        $db = \Config\Database::connect();
        $username = htmlspecialchars($this->request->getPost('username'), ENT_QUOTES, 'UTF-8');
        $password = $this->request->getPost('password');

        $query = $db->table('user')->where('username', $username)->get();
---
SELECT *
FROM `user`
WHERE `username` = 'cmandasari'