app/Controllers/PeriksaController.php

SELECT *
FROM `pasien`
SELECT *
FROM `dokter`
---
    public function index()
    {
        $pasienModel = new PasienModel();
        $dokterModel = new DokterModel();
        $periksaModel = new PeriksaModel();

        $data['pasien'] = $pasienModel->findAll();
        $data['dokter'] = $dokterModel->findAll();