app/Models/PeriksaModel.php

    public function getPeriksaWithRelations()
    {
        return $this->select('periksa.*, pasien.nama AS nama_pasien, dokter.nama AS nama_dokter')
                    ->join('pasien', 'pasien.id = periksa.pasien')
                    ->join('dokter', 'dokter.id = periksa.dokter')
                    ->findAll();
---
SELECT `periksa`.*, `pasien`.`nama` AS `nama_pasien`, `dokter`.`nama` AS `nama_dokter`
FROM `periksa`
JOIN `pasien` ON `pasien`.`id` = `periksa`.`pasien`
JOIN `dokter` ON `dokter`.`id` = `periksa`.`dokter`